## Staging: cognito
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 12 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                            NAME                            |
|----------|------------------------------------------------------------|
| delete   | `aws_secretsmanager_secret.cognito_notify_api_key`         |
|          | `aws_secretsmanager_secret_version.cognito_notify_api_key` |
| update   | `aws_cloudwatch_log_group.cognito_email_sender`            |
|          | `aws_cloudwatch_log_group.cognito_pre_sign_up`             |
|          | `aws_cognito_user_pool.forms`                              |
|          | `aws_iam_policy.cognito_lambda_kms`                        |
|          | `aws_iam_policy.cognito_lambda_logging`                    |
|          | `aws_iam_policy.cognito_lambda_secrets`                    |
|          | `aws_iam_policy.cognito_userpool_import_logging`           |
|          | `aws_iam_role.cognito_lambda`                              |
|          | `aws_iam_role.cognito_userpool_import`                     |
|          | `aws_kms_key.cognito_encryption`                           |
|          | `aws_lambda_function.cognito_email_sender`                 |
|          | `aws_lambda_function.cognito_pre_sign_up`                  |
| recreate | `aws_lambda_layer_version.cognito_email_sender_nodejs`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cognito_lambda_kms will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cognito_lambda_kms" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:ca-central-1:687401027353:key/976bc5ab-8b78-4ee2-9b86-5fc56942233e",
            ]
        }
    }

  # aws_cloudwatch_log_group.cognito_email_sender will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "cognito_email_sender" {
        id                = "/aws/lambda/Cognito_Email_Sender"
        name              = "/aws/lambda/Cognito_Email_Sender"
      ~ retention_in_days = 90 -> 731
        tags              = {}
      ~ tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.cognito_pre_sign_up will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "cognito_pre_sign_up" {
        id                = "/aws/lambda/Cognito_Pre_Sign_Up"
        name              = "/aws/lambda/Cognito_Pre_Sign_Up"
      ~ retention_in_days = 90 -> 731
        tags              = {}
      ~ tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
        id                         = "ca-central-1_Cguq9JNQ1"
        name                       = "forms_user_pool"
        tags                       = {}
      ~ tags_all                   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_iam_policy.cognito_lambda_kms will be updated in-place
  ~ resource "aws_iam_policy" "cognito_lambda_kms" {
        id          = "arn:aws:iam::687401027353:policy/cognito_lambda_kms"
        name        = "cognito_lambda_kms"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:687401027353:key/976bc5ab-8b78-4ee2-9b86-5fc56942233e"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags        = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.cognito_lambda_logging will be updated in-place
  ~ resource "aws_iam_policy" "cognito_lambda_logging" {
        id          = "arn:aws:iam::687401027353:policy/cognito_lambda_logging"
        name        = "cognito_lambda_logging"
      ~ tags        = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.cognito_lambda_secrets will be updated in-place
  ~ resource "aws_iam_policy" "cognito_lambda_secrets" {
        id          = "arn:aws:iam::687401027353:policy/cognito_lambda_secrets"
        name        = "cognito_lambda_secrets"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_notify_api_key-RFNlh9" -> "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-eR3nNp"
                      - Sid      = ""
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ tags        = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.cognito_userpool_import_logging will be updated in-place
  ~ resource "aws_iam_policy" "cognito_userpool_import_logging" {
        id          = "arn:aws:iam::687401027353:policy/cognito_userpool_import_logging"
        name        = "cognito_userpool_import_logging"
      ~ tags        = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_role.cognito_lambda will be updated in-place
  ~ resource "aws_iam_role" "cognito_lambda" {
        id                    = "iam_for_cognito_lambda"
        name                  = "iam_for_cognito_lambda"
      ~ tags                  = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.cognito_userpool_import will be updated in-place
  ~ resource "aws_iam_role" "cognito_userpool_import" {
        id                    = "role_for_cognito_user_pool_import"
        name                  = "role_for_cognito_user_pool_import"
      ~ tags                  = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_kms_key.cognito_encryption will be updated in-place
  ~ resource "aws_kms_key" "cognito_encryption" {
        id                                 = "976bc5ab-8b78-4ee2-9b86-5fc56942233e"
      ~ tags                               = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (11 unchanged attributes hidden)
    }

  # aws_lambda_function.cognito_email_sender will be updated in-place
  ~ resource "aws_lambda_function" "cognito_email_sender" {
        id                             = "Cognito_Email_Sender"
      ~ last_modified                  = "2023-12-07T21:21:59.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:15",
        ] -> (known after apply)
      ~ source_code_hash               = "Au9QF/JOavDRQ5VevDLPhwxxPe8omiNw08gEHhHx55Q=" -> "NSU8SXeZpoTv6Olyan0QR5D6xhgeEeDfsGDZIDaUziw="
      ~ tags                           = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "NOTIFY_API_KEY" = (sensitive value)
                # (3 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.cognito_pre_sign_up will be updated in-place
  ~ resource "aws_lambda_function" "cognito_pre_sign_up" {
        id                             = "Cognito_Pre_Sign_Up"
      ~ tags                           = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.cognito_email_sender_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "cognito_email_sender_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:15" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-12-07T21:21:58.576+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:15" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "ds9qa4ZKrb4ykZpLYXSUy9muksxn2P5zC1R84FonZQE=" -> "5RxmXnpXQnHTMrV+xee0eg/zg1Q8Vh/nNy/cIPXtKzA=" # forces replacement
      ~ source_code_size            = 4952580 -> (known after apply)
      ~ version                     = "15" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.cognito_notify_api_key will be destroyed
  # (because aws_secretsmanager_secret.cognito_notify_api_key is not in configuration)
  - resource "aws_secretsmanager_secret" "cognito_notify_api_key" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_notify_api_key-RFNlh9" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_notify_api_key-RFNlh9" -> null
      - name                           = "cognito_notify_api_key" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_secretsmanager_secret_version.cognito_notify_api_key will be destroyed
  # (because aws_secretsmanager_secret_version.cognito_notify_api_key is not in configuration)
  - resource "aws_secretsmanager_secret_version" "cognito_notify_api_key" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_notify_api_key-RFNlh9" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_notify_api_key-RFNlh9|23C81AA7-F8FF-49CC-9C61-7EE78C295BF3" -> null
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_notify_api_key-RFNlh9" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "23C81AA7-F8FF-49CC-9C61-7EE78C295BF3" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

Plan: 1 to add, 12 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cognito_email_sender"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cognito_pre_sign_up"]
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_userpool_import_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.cognito_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.cognito_userpool_import"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cognito_encryption"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.cognito_email_sender"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.cognito_pre_sign_up"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
